Repository: Ported/flashy
Catalog: flutter/lib/l10n/app_*.arb
Languages: sv

# appTitle
source: Flashy's Math Adventure
sv: Flashy's Matematikäventyr

# appTagline
source: Help Flashy find the way home!
sv: Hjälp Flashy att hitta hem!

source: Loading Pyodide...
sv: Laddar Pyodide...

# loadingPython
source: Setting up Python environment...
sv: Förbereder Python...

# loadingSpeech
source: Loading speech model...
sv: Laddar röstmodell...

# loadingReady
source: Ready!
sv: Redo!

# playerWhoPlaying
source: Who's playing today?
sv: Vem spelar idag?

# playerNoPlayers
source: No players yet!
sv: Inga spelare ännu!

# playerNewPlayer
source: New Player
sv: Ny spelare

# playerLevel
source: Level
sv: Nivå

# playerNewTitle
source: New Player
sv: Ny spelare

# playerEnterName
source: Enter your name...
sv: Skriv ditt namn...

# playerCreate
source: Create
sv: Skapa

# playerCancel
source: Cancel
sv: Avbryt

# playerErrorEmpty
source: Please enter a name
sv: Skriv ett namn

# playerErrorInvalid
source: Please use letters and numbers only
sv: Använd bara bokstäver och siffror

# playerErrorExists
source: '{name}' already exists!
sv: '{name}' finns redan!

# playerErrorTooLong
source: Name too long (max 20 characters)
sv: Namnet är för långt (max 20 tecken)

# playerErrorTaken
source: Name already taken on leaderboard. Choose another!
sv: Namnet är redan taget. Välj ett annat!

# playerErrorRegistration
source: Registration failed
sv: Registrering misslyckades

# playerErrorConnection
source: Could not connect to leaderboard. Try again.
sv: Kunde inte ansluta. Försök igen.

# playerRegistering
source: Registering...
sv: Registrerar...

# navBack
source: Back
sv: Tillbaka

# navContinue
source: Continue
sv: Fortsätt

# navReplay
source: Replay
sv: Spela igen

# gameplayScore
source: Score: {score}
sv: Poäng: {score}

# gameplayTypeAnswer
source: Type answer + Enter
sv: Skriv svar + Enter

# gameplayListening
source: Listening...
sv: Lyssnar...

# gameplayMicRequest
source: Requesting microphone...
sv: Ber om mikrofon...

# gameplayCorrect
source: Correct!
sv: Rätt!

# gameplayWrong
source: Wrong!
sv: Fel!

# resultComplete
source: Level Complete!
sv: Nivå klar!

# resultFailed
source: Keep Practicing!
sv: Fortsätt träna!

# resultNewBest
source: NEW BEST!
sv: NYTT REKORD!

# resultCorrect
source: {correct}/{total} correct
sv: {correct}/{total} rätt

# resultScore
source: Score: {score}
sv: Poäng: {score}

# resultTime
source: Time: {time}
sv: Tid: {time}

# resultUpdating
source: Updating leaderboard...
sv: Uppdaterar topplistan...

# leaderboardTitle
source: Leaderboard
sv: Topplista

# victoryTitle
source: VICTORY!
sv: SEGER!

# gameCompleteTitle
source: HOME AT LAST!
sv: ÄNTLIGEN HEMMA!

# gameCompleteHint
source: Click anywhere to return to menu...
sv: Klicka för att gå till menyn...

# introStory
source: "Oh no! Where am I?" "I chased that butterfly too far..." "I need to find my way home!"
sv: "Åh nej! Var är jag?" "Jag jagade den där fjärilen för långt..." "Jag måste hitta hem!"

# introHint
source: Click anywhere to continue...
sv: Klicka för att fortsätta...

# inputVoice
source: Voice
sv: Röst

# inputKeyboard
source: Keyboard
sv: Tangentbord

# world1Name
source: Addition Alps
sv: Additions-Alperna

# world2Name
source: Subtraction Swamp
sv: Subtraktions-Träsket

# world3Name
source: Multiplication Meadows
sv: Multiplikations-Ängarna

# world4Name
source: Division Desert
sv: Divisions-Öknen

# world1Intro
source: Flashy woke up alone in the cold mountains. "Where am I? I need to find my way home!" The only way forward is up through the Addition Alps...
sv: Flashy vaknade ensam i de kalla bergen. "Var är jag? Jag måste hitta hem!" Den enda vägen framåt är upp genom Additions-Alperna...

# world2Intro
source: The mountains gave way to murky wetlands. "It's so foggy here... but I must keep going!" Flashy stepped carefully into the Subtraction Swamp...
sv: Bergen övergick i dimmiga våtmarker. "Det är så dimmigt här... men jag måste fortsätta!" Flashy klev försiktigt in i Subtraktions-Träsket...

# world3Intro
source: Beautiful flowers swayed in the breeze. "What a lovely place... but I must keep moving!" The Multiplication Meadows bloomed with possibility...
sv: Vackra blommor vajade i vinden. "Vilken fin plats... men jag måste fortsätta!" Multiplikations-Ängarna blommade med möjligheter...

# world4Intro
source: The heat hit Flashy like a wall. "So hot... but I can almost smell home!" The Division Desert stretched endlessly before...
sv: Hettan träffade Flashy som en vägg. "Så varmt... men jag kan nästan lukta hemmet!" Divisions-Öknen sträckte sig oändligt framåt...

# world1FriendIntro
source: "Hoo-hoo! I'm Carry the Owl!" "I've watched many travelers climb these peaks." "Remember: when numbers get big, just carry on!" "Let me help you on your journey home."
sv: "Hu-hu! Jag är Carry Ugglan!" "Jag har sett många resenärer klättra dessa berg." "Kom ihåg: när talen blir stora, minnessiffra!" "Låt mig hjälpa dig på din resa hem."

# world2FriendName
source: Borrow
sv: Låna

# world2FriendIntro
source: "Slow down there, young pup!" "I'm Borrow the Turtle. I've lived here for centuries." "When you need to take away more than you have," "just borrow from your neighbor. Works every time!"
sv: "Sakta i backarna, lilla valpen!" "Jag är Låna Sköldpaddan. Jag har bott här i århundraden." "När du behöver ta bort mer än du har," "låna från grannen. Fungerar varje gång!"

# world3FriendName
source: Times
sv: Gånger

# world3FriendIntro
source: "Oh my, oh my! A visitor!" *hops excitedly* "I'm Times the Rabbit! I multiply EVERYTHING!" "One carrot becomes two, two become four!" "Multiplication is just fast addition, you know!"
sv: "Oj oj oj! En besökare!" *hoppar glatt* "Jag är Gånger Kaninen! Jag multiplicerar ALLT!" "En morot blir två, två blir fyra!" "Multiplikation är bara snabb addition!"

# world4FriendName
source: Remainder
sv: Rest

# world4FriendIntro
source: "Ah, a traveler! I am Remainder the Camel." "I carry what's left over from every division." "Remember: divide means to share equally!" "Split it up fair, and you'll find your answer."
sv: "Ah, en resenär! Jag är Rest Kamelen." "Jag bär det som blir över från varje division." "Kom ihåg: dela betyder att fördela lika!" "Dela rättvist, så hittar du svaret."

# world1BossName
source: Summit
sv: Toppen

# world1BossIntro
source: "So, little pup, you think you can cross MY mountain?" "I am Summit, guardian of the Alps!" "Prove your addition skills... if you can keep up!"
sv: "Så, lilla valpen, tror du att du kan korsa MITT berg?" "Jag är Toppen, väktaren av Alperna!" "Bevisa dina additionskunskaper... om du kan hänga med!"

# world1BossDefeat
source: "Impressive, little one! You've earned passage." "The path ahead leads to the Subtraction Swamp." "May your numbers stay strong!"
sv: "Imponerande, liten! Du har förtjänat passage." "Vägen framåt leder till Subtraktions-Träsket." "Må dina tal förbli starka!"

# world2BossIntro
source: "RIBBIT! Who dares enter my swamp?" "I am Minus, the Frog King!" "Let's see if you can subtract as fast as I can jump!"
sv: "KVACK! Vem vågar sig in i mitt träsk?" "Jag är Minus, Grodkungen!" "Låt oss se om du kan subtrahera lika snabbt som jag hoppar!"

# world2BossDefeat
source: "RIBBIT... you've bested me, small one." "The meadows lie ahead. Enjoy the flowers!" "Hop along now!"
sv: "KVACK... du har besegrat mig, liten." "Ängarna ligger framför dig. Njut av blommorna!" "Hoppa vidare nu!"

# world3BossName
source: Countess Calculata
sv: Grevinnan Calculata

# world3BossIntro
source: "Well, well... the lost puppy arrives." "I am Countess Calculata, master of multiplication!" "Beat me, and the desert path shall open!"
sv: "Nåväl... den förlorade valpen anländer." "Jag är Grevinnan Calculata, mästare av multiplikation!" "Besegra mig, så öppnas ökenvägen!"

# world3BossDefeat
source: "Magnificent! You've mastered multiplication!" "The desert lies ahead. Stay hydrated!" "Your home draws ever closer."
sv: "Magnifikt! Du har bemästrat multiplikation!" "Öknen ligger framför dig. Håll dig hydrerad!" "Ditt hem närmar sig."

# world4BossName
source: The Sphinx of Splits
sv: Delnings-Sfinxen

# world4BossIntro
source: "HALT, wanderer! None pass without solving my riddles." "I am the Sphinx of Splits!" "Divide correctly, or be lost to the sands forever!"
sv: "STOPP, vandrare! Ingen passerar utan att lösa mina gåtor." "Jag är Delnings-Sfinxen!" "Dividera rätt, eller försvinn i sanden för alltid!"

# world4BossDefeat
source: "You have wisdom beyond your years, young pup." "Look there, beyond the dunes..." "Is that... your HOME?"
sv: "Du har visdom bortom dina år, lilla valpen." "Titta där, bortom dynerna..." "Är det... ditt HEM?"

# gameCompleteStory
source: "I'm home! I'm finally home!" Flashy's family rushed out to greet the little pup. "We were so worried! Where did you go?" "I went on the most amazing adventure..." "And I learned SO much math along the way!"
sv: "Jag är hemma! Jag är äntligen hemma!" Flashys familj rusade ut för att möta den lilla valpen. "Vi var så oroliga! Var har du varit?" "Jag var på det mest fantastiska äventyret..." "Och jag lärde mig SÅ mycket matte på vägen!"

# level1Name
source: Trailhead
sv: Startpunkten

# level2Name
source: Foothills
sv: Kullarna

# level3Name
source: Snowy Path
sv: Snöstigen

# level4Name
source: Alpine Meadow
sv: Alpängen

# level5Name
source: Mountain Trail
sv: Bergsleden

# level6Name
source: Carry's Roost
sv: Carrys Näste

# level7Name
source: Rocky Pass
sv: Klipppasset

# level8Name
source: Steep Cliffs
sv: Branta Klippor

# level9Name
source: Final Ascent
sv: Sista Stigningen

# level10Name
source: Summit's Challenge
sv: Toppens Utmaning

# level11Name
source: Marsh Edge
sv: Träskkanten

# level12Name
source: Muddy Waters
sv: Leriga Vatten

# level13Name
source: Foggy Path
sv: Dimmiga Stigen

# level14Name
source: Lily Pads
sv: Näckrosbladen

# level15Name
source: Cypress Grove
sv: Cypresslunden

# level16Name
source: Borrow's Hollow
sv: Lånas Håla

# level17Name
source: Murky Depths
sv: Mörka Djupen

# level18Name
source: Tangled Vines
sv: Trassliga Rankor

# level19Name
source: Swamp's Heart
sv: Träskets Hjärta

# level20Name
source: Minus's Throne
sv: Minus Tron

# level21Name
source: Flower Field
sv: Blomsterfältet

# level22Name
source: Butterfly Path
sv: Fjärilsstigen

# level23Name
source: Clover Patch
sv: Klöverfläcken

# level24Name
source: Honeybee Hive
sv: Bikupan

# level25Name
source: Dandelion Dell
sv: Maskrosdalen

# level26Name
source: Times's Burrow
sv: Gångers Lya

# level27Name
source: Pollen Storm
sv: Pollenstormen

# level28Name
source: Rainbow Bridge
sv: Regnbågsbron

# level29Name
source: Final Bloom
sv: Sista Blomningen

# level30Name
source: Calculata's Garden
sv: Calculatas Trädgård

# level31Name
source: Oasis Gate
sv: Oasporten

# level32Name
source: Sandy Trail
sv: Sandstigen

# level33Name
source: Dune Ridge
sv: Dynkammen

# level34Name
source: Scorpion Pass
sv: Skorpionpasset

# level35Name
source: Mirage Valley
sv: Hägringsdalen

# level36Name
source: Remainder's Rest
sv: Rests Vila

# level37Name
source: Sandstorm
sv: Sandstormen

# level38Name
source: Sunscorch
sv: Solbrännan

# level39Name
source: Pyramid's Shadow
sv: Pyramidens Skugga

# level40Name
source: Sphinx's Riddles
sv: Sfinxens Gåtor

# navPlay
source: Play
sv: Spela

# navAbout
source: About
sv: Om

# navPrivacy
source: Privacy
sv: Integritet

# leaderboardError
source: Failed to load leaderboard
sv: Kunde inte ladda topplistan

# leaderboardEmpty
source: No scores yet. Be the first!
sv: Inga poäng ännu. Bli den första!

# resultBestStreak
source: Best Streak: {streak}
sv: Bästa svit: {streak}

# gameplayBossLevel
source: BOSS: Level {level}
sv: BOSS: Nivå {level}

# gameplayLevel
source: Level {level}
sv: Nivå {level}

# gameplayPointsEarned
source: Correct! +{points}
sv: Rätt! +{points}

# gameplayStreak
source: Score: {score} | {streak} streak!
sv: Poäng: {score} | {streak} i rad!
